rails/blog/app/controllers/articles_controller.rb

  def create
    # render plain: params[:article].inspect
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "HAHAHA FUK"], ["text", "THIS IS SO WRONG"], ["created_at", "2017-06-19 03:06:18.485631"], ["updated_at", "2017-06-19 03:06:18.485631"]]